Show / Hide Table of Contents
Class ConnectedMember
ConnectedMember
Inheritance
System.Object
OpenObject
OpenElementId
ConnectedMember
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.SteelStructure.ConnectedMember,CI.StructuralElements", "CI.StructModel.Structure.IConnectedMember,CI.BasicTypes")]
public class ConnectedMember : OpenElementId
Properties
Improve this Doc   View Source
IsContinuous
IsContinuous
Declaration
public bool IsContinuous { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Length
Length of the member
Declaration
public double Length { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MemberId
MemberId
Declaration
public ReferenceElement MemberId { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
Declaration
public string OriginalModelId { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source